TRM_Server/app/controllers/api/messages_controller.rb

INSERT INTO `messages` (`content`, `created_at`, `fullname`, `updated_at`, `username`) VALUES (?, ?, ?, ?, ?)  [["content", "Hello Ruby"], ["created_at", Wed, 19 Feb 2014 02:59:57 UTC +00:00], ["fullname", "Thanh Adam"], ["updated_at", Wed, 19 Feb 2014 02:59:57 UTC +00:00], ["username", "Adam"]]
---
  def create
    message= Message.new(message_params)
    message.save

SELECT users.id,users.fullname,messages.content,messages.created_at FROM `messages` INNER JOIN `users` ON `users`.`id` = `messages`.`user_id` WHERE (DAY(messages.
---
  def index
    #Get all message from 5 days ago to now
    messages=Message.joins(:user).select("users.id,users.fullname,messages.content,messages.created_at").where("DAY(messages.
      created_at) >= ? ",Time.now.day-5).order("messages.id ASC")