TRM_Server/app/controllers/api/registrations_controller.rb

INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `fullname`, `updated_at`, `username`) VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.new(user_params)
    if user.save