TRM_Server/app/controllers/api/sessions_controller.rb

  def create
    resource_class.new
    resource = User.find_for_database_authentication(:username=>params[:user][:username])
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'username' ORDER BY `users`.`id` ASC LIMIT 1